<!-- dflook/terraform-github-actions {"workspace":"colours-test-2","backend_type":"remote","backend":"531be5334b0e22d4860e7deb269b518ebd6b076021ddfa3b01c1197fd9339a03","plan_job_ref":"Job Test Terraform cloud #165 at https://github.com/dflook/terraform-github-actions/actions/runs/5417009069","plan_hash":"d0100864767f6e00849b51ba7af3206efb47b48f577e959461872f418f8bd76c","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __colours-test-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #165](https://github.com/dflook/terraform-github-actions/actions/runs/5417009069)